Revit 2027 API
CADLinkType.Reload(CADLinkOptions) Method
 Loads or reloads the link from its currently-stored location. If the link is an external resource, Revit will contact the IExternalResourceServer to get the latest version of the link.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LinkLoadResult Reload(
	CADLinkOptions options
)
Public Function Reload (
	options As CADLinkOptions
) As LinkLoadResult
public:
LinkLoadResult^ Reload(
	CADLinkOptions^ options
)
member Reload :
        options : CADLinkOptions -> LinkLoadResult
Parameters
options CADLinkOptions
 Options for reloading the link. Options include the ability to preserve graphic overrides on reload.
Return Value
LinkLoadResult
 An object containing the ElementId of the link and an enum value indicating any errors which occurred while trying to load.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  This CADLinkType represents an import and cannot be used as a link. -or- The element "this CADLinkType" is in a read-only document.
Remarks
If the link is currently loaded, any changes made in-memory to the link's shared coordinates will be discarded.
See Also
Reference
CADLinkType Class
Reload Overload
Autodesk.Revit.DB Namespace